VikSle/STM32F411RE_FreeRtos/Library/HY32D/GLCD/GLCD.c
/****************************************Copyright (c)**************************************************                         
**
**                                 http://www.powermcu.com
**
**--------------File Info-------------------------------------------------------------------------------
** File name:			GLCD.c
** Descriptions:		This example describes how to use glcd
**						
**------------------------------------------------------------------------------------------------------
** Created by:			AVRman
** Created date:		2011-3-29
** Version:			2.0
** Descriptions:		The original version
**
**------------------------------------------------------------------------------------------------------
** Modified by:			
** Modified date:	
** Version:
** Descriptions:		
********************************************************************************************************/

/* Includes ------------------------------------------------------------------*/
#include "GLCD.h" 
#include "AsciiLib.h"
#include "main.h"
#include "stm32f4xx_hal_gpio.h"


/* Program is based on the STM32 MCU */
/* If you are not use STM32, you must transplant program */

/*******************************************************************************
* Function Name  : Lcd_Configuration
* Description    : setting the IO to control LCD
* Input          : None
* Output         : None
* Return         : None
* Attention      : None
*******************************************************************************/
static void LCD_Configuration(void)
{
        /* If you are not use STM32, you must change it */

//	GPIO_InitTypeDef GPIO_InitStructure;

	/* Enable GPIOC and GPIOE clocks */
//	RCC_APB2PeriphClockCmd( RCC_APB2Periph_GPIOC | RCC_APB2Periph_GPIOE, ENABLE);

/*
    PE.00(D0), PE.01(D1), PE.02(D2), PE.03(D3), PE.04(D4), PE.05(D5), PE.06(D6), PE.07(D7), PE.08(D8)
    PE.09(D9), PE.10(D10), PE.11(D11), PE.12(D12), PE.13(D13), PE.14(D14), PE.15(D15)   */
/*
        /* setting the IO to output mode */

//	GPIO_InitStructure.GPIO_Pin = GPIO_Pin_All;
//	GPIO_InitStructure.GPIO_Speed = GPIO_Speed_50MHz;
//	GPIO_InitStructure.GPIO_Mode = GPIO_Mode_Out_PP;
//	GPIO_Init(GPIOE, &GPIO_InitStructure);

	/* PC.08(RS), PC.07(WR), PC.06(RD) */

        /* setting the IO to output mode */

//	GPIO_InitStructure.GPIO_Pin = GPIO_Pin_6 | GPIO_Pin_7 | GPIO_Pin_8;
//	GPIO_InitStructure.GPIO_Speed = GPIO_Speed_50MHz;
//	GPIO_InitStructure.GPIO_Mode = GPIO_Mode_Out_PP;
//	GPIO_Init(GPIOC, &GPIO_InitStructure);

	/* PC.09(CS)*/

        /* setting the IO to output mode */

//	GPIO_InitStructure.GPIO_Pin = GPIO_Pin_9;
//	GPIO_InitStructure.GPIO_Speed = GPIO_Speed_50MHz;
//	GPIO_InitStructure.GPIO_Mode = GPIO_Mode_Out_PP;
//	GPIO_Init(GPIOC, &GPIO_InitStructure);
}


/*******************************************************************************
* Function Name  : LCD_WriteIndex
* Description    : LCD write register address ( on include data only address )
* Input          : - index: register address
* Output         : None
* Return         : None
* Attention      : None
*******************************************************************************/
void LCD_WriteIndex(unsigned short index)
{
        /* If you are not use STM32, you must change it */

	Clr_Rs;   /* RS low */
	Set_nRd;  /* RD high */
	
        /* write data */
//	GPIOE->ODR = index;	 /* GPIO_Write(GPIOE,index); */
	
	HAL_GPIO_WritePin(D00_GPIO_Port, D00_Pin, (GPIO_PinState)(index&0x01));
	HAL_GPIO_WritePin(D01_GPIO_Port, D01_Pin, (GPIO_PinState)((index>>1)&0x01));
	HAL_GPIO_WritePin(D02_GPIO_Port, D02_Pin, (GPIO_PinState)((index>>2)&0x01));
	HAL_GPIO_WritePin(D03_GPIO_Port, D03_Pin, (GPIO_PinState)((index>>3)&0x01));
	HAL_GPIO_WritePin(D04_GPIO_Port, D04_Pin, (GPIO_PinState)((index>>4)&0x01));
	HAL_GPIO_WritePin(D05_GPIO_Port, D05_Pin, (GPIO_PinState)((index>>5)&0x01));
	HAL_GPIO_WritePin(D06_GPIO_Port, D06_Pin, (GPIO_PinState)((index>>6)&0x01));
	HAL_GPIO_WritePin(D07_GPIO_Port, D07_Pin, (GPIO_PinState)((index>>7)&0x01));
	HAL_GPIO_WritePin(D08_GPIO_Port, D08_Pin, (GPIO_PinState)((index>>8)&0x01));
	HAL_GPIO_WritePin(D09_GPIO_Port, D09_Pin, (GPIO_PinState)((index>>9)&0x01));
	HAL_GPIO_WritePin(D10_GPIO_Port, D10_Pin, (GPIO_PinState)((index>>10)&0x01));
	HAL_GPIO_WritePin(D11_GPIO_Port, D11_Pin, (GPIO_PinState)((index>>11)&0x01));
	HAL_GPIO_WritePin(D12_GPIO_Port, D12_Pin, (GPIO_PinState)((index>>12)&0x01));
	HAL_GPIO_WritePin(D13_GPIO_Port, D13_Pin, (GPIO_PinState)((index>>13)&0x01));
	HAL_GPIO_WritePin(D14_GPIO_Port, D14_Pin, (GPIO_PinState)((index>>14)&0x01));
	HAL_GPIO_WritePin(D15_GPIO_Port, D15_Pin, (GPIO_PinState)((index>>15)&0x01));


	Clr_nWr;  /* Wr low */
	Set_nWr;  /* Wr high */
}

/*******************************************************************************
* Function Name  : LCD_WriteData
* Description    : LCD write register data
* Input          : - index: register data
* Output         : None
* Return         : None
* Attention		 : None
*******************************************************************************/
void LCD_WriteData(unsigned short data)
{
        /* If you are not use STM32, you must change it */

	Set_Rs;  /* RS high */
	
        /* write data */
//	GPIOE->ODR = data;	 /* GPIO_Write(GPIOE,data); */
	HAL_GPIO_WritePin(D00_GPIO_Port, D00_Pin, (GPIO_PinState)(data&0x01));
	HAL_GPIO_WritePin(D01_GPIO_Port, D01_Pin, (GPIO_PinState)((data>>1)&0x01));
	HAL_GPIO_WritePin(D02_GPIO_Port, D02_Pin, (GPIO_PinState)((data>>2)&0x01));
	HAL_GPIO_WritePin(D03_GPIO_Port, D03_Pin, (GPIO_PinState)((data>>3)&0x01));
	HAL_GPIO_WritePin(D04_GPIO_Port, D04_Pin, (GPIO_PinState)((data>>4)&0x01));
	HAL_GPIO_WritePin(D05_GPIO_Port, D05_Pin, (GPIO_PinState)((data>>5)&0x01));
	HAL_GPIO_WritePin(D06_GPIO_Port, D06_Pin, (GPIO_PinState)((data>>6)&0x01));
	HAL_GPIO_WritePin(D07_GPIO_Port, D07_Pin, (GPIO_PinState)((data>>7)&0x01));
	HAL_GPIO_WritePin(D08_GPIO_Port, D08_Pin, (GPIO_PinState)((data>>8)&0x01));
	HAL_GPIO_WritePin(D09_GPIO_Port, D09_Pin, (GPIO_PinState)((data>>9)&0x01));
	HAL_GPIO_WritePin(D10_GPIO_Port, D10_Pin, (GPIO_PinState)((data>>10)&0x01));
	HAL_GPIO_WritePin(D11_GPIO_Port, D11_Pin, (GPIO_PinState)((data>>11)&0x01));
	HAL_GPIO_WritePin(D12_GPIO_Port, D12_Pin, (GPIO_PinState)((data>>12)&0x01));
	HAL_GPIO_WritePin(D13_GPIO_Port, D13_Pin, (GPIO_PinState)((data>>13)&0x01));
	HAL_GPIO_WritePin(D14_GPIO_Port, D14_Pin, (GPIO_PinState)((data>>14)&0x01));
	HAL_GPIO_WritePin(D15_GPIO_Port, D15_Pin, (GPIO_PinState)((data>>15)&0x01));
	
	Clr_nWr;  /* Wr low */ 
	Set_nWr;  /* Wr high */
}

