VikSle/STM32F411RE_FreeRtos/Library/HY32D/GLCD/GLCD.c
/*******************************************************************************
* Function Name  : LCD_ReadData
* Description    : LCD read data
* Input          : None
* Output         : None
* Return         : return data
* Attention	 : None
*******************************************************************************/
unsigned short LCD_ReadData(void)
{ 
        /* If you are not use STM32, you must change it */

	unsigned short value;

	Set_Rs;  /* RS high */
	Set_nWr; /* Wr high */
	Clr_nRd; /* Rd low */

	GPIO_InitTypeDef GPIO_InitStruct = {0};

/*
    PE.00(D0), PE.01(D1), PE.02(D2), PE.03(D3), PE.04(D4), PE.05(D5), PE.06(D6), PE.07(D7), PE.08(D8)
    PE.09(D9), PE.10(D10), PE.11(D11), PE.12(D12), PE.13(D13), PE.14(D14), PE.15(D15)   */
/*

    /* setting the IO to input mode */

//    GPIO_InitTypeDef GPIO_InitStructure;
//    GPIO_InitStructure.GPIO_Pin = GPIO_Pin_All;
//    GPIO_InitStructure.GPIO_Speed = GPIO_Speed_50MHz;
//    GPIO_InitStructure.GPIO_Mode = GPIO_Mode_IN_FLOATING;
//    GPIO_Init(GPIOE, &GPIO_InitStructure);

	  GPIO_InitStruct.Pin = D00_Pin|D01_Pin|D02_Pin|D10_Pin
	                          |D12_Pin|D13_Pin|D14_Pin|D15_Pin
	                          |D05_Pin|D06_Pin|D07_Pin|D08_Pin
	                          |D09_Pin;
	  GPIO_InitStruct.Mode = GPIO_MODE_INPUT;
	  GPIO_InitStruct.Pull = GPIO_NOPULL;
	  HAL_GPIO_Init(GPIOB, &GPIO_InitStruct);

	  GPIO_InitStruct.Pin = D03_Pin|D04_Pin;
	  GPIO_InitStruct.Mode = GPIO_MODE_INPUT;
	  GPIO_InitStruct.Pull = GPIO_NOPULL;
	  HAL_GPIO_Init(GPIOC, &GPIO_InitStruct);

	  GPIO_InitStruct.Pin = D11_Pin;
	  GPIO_InitStruct.Mode = GPIO_MODE_INPUT;
	  GPIO_InitStruct.Pull = GPIO_NOPULL;
	  HAL_GPIO_Init(GPIOA, &GPIO_InitStruct);



    /* read data */
//    value = GPIO_ReadInputData(GPIOE);
//    value = GPIO_ReadInputData(GPIOE);

	  value=
	 ((HAL_GPIO_ReadPin(D00_GPIO_Port, D00_Pin)&0x1)    )|
	 ((HAL_GPIO_ReadPin(D01_GPIO_Port, D01_Pin)&0x1)<<1 )|
	 ((HAL_GPIO_ReadPin(D02_GPIO_Port, D02_Pin)&0x1)<<2 )|
	 ((HAL_GPIO_ReadPin(D03_GPIO_Port, D03_Pin)&0x1)<<3 )|
	 ((HAL_GPIO_ReadPin(D04_GPIO_Port, D04_Pin)&0x1)<<4 )|
	 ((HAL_GPIO_ReadPin(D05_GPIO_Port, D05_Pin)&0x1)<<5 )|
	 ((HAL_GPIO_ReadPin(D06_GPIO_Port, D06_Pin)&0x1)<<6 )|
	 ((HAL_GPIO_ReadPin(D07_GPIO_Port, D07_Pin)&0x1)<<7 )|
	 ((HAL_GPIO_ReadPin(D08_GPIO_Port, D08_Pin)&0x1)<<8 )|
	 ((HAL_GPIO_ReadPin(D09_GPIO_Port, D09_Pin)&0x1)<<9 )|
	 ((HAL_GPIO_ReadPin(D10_GPIO_Port, D10_Pin)&0x1)<<10)|
	 ((HAL_GPIO_ReadPin(D11_GPIO_Port, D11_Pin)&0x1)<<11)|
	 ((HAL_GPIO_ReadPin(D12_GPIO_Port, D12_Pin)&0x1)<<12)|
	 ((HAL_GPIO_ReadPin(D13_GPIO_Port, D13_Pin)&0x1)<<13)|
	 ((HAL_GPIO_ReadPin(D14_GPIO_Port, D14_Pin)&0x1)<<14)|
	 ((HAL_GPIO_ReadPin(D15_GPIO_Port, D15_Pin)&0x1)<<15);

	  value=
	 ((HAL_GPIO_ReadPin(D00_GPIO_Port, D00_Pin)&0x1)    )|
	 ((HAL_GPIO_ReadPin(D01_GPIO_Port, D01_Pin)&0x1)<<1 )|
	 ((HAL_GPIO_ReadPin(D02_GPIO_Port, D02_Pin)&0x1)<<2 )|
	 ((HAL_GPIO_ReadPin(D03_GPIO_Port, D03_Pin)&0x1)<<3 )|
	 ((HAL_GPIO_ReadPin(D04_GPIO_Port, D04_Pin)&0x1)<<4 )|
	 ((HAL_GPIO_ReadPin(D05_GPIO_Port, D05_Pin)&0x1)<<5 )|
	 ((HAL_GPIO_ReadPin(D06_GPIO_Port, D06_Pin)&0x1)<<6 )|
	 ((HAL_GPIO_ReadPin(D07_GPIO_Port, D07_Pin)&0x1)<<7 )|
	 ((HAL_GPIO_ReadPin(D08_GPIO_Port, D08_Pin)&0x1)<<8 )|
	 ((HAL_GPIO_ReadPin(D09_GPIO_Port, D09_Pin)&0x1)<<9 )|
	 ((HAL_GPIO_ReadPin(D10_GPIO_Port, D10_Pin)&0x1)<<10)|
	 ((HAL_GPIO_ReadPin(D11_GPIO_Port, D11_Pin)&0x1)<<11)|
	 ((HAL_GPIO_ReadPin(D12_GPIO_Port, D12_Pin)&0x1)<<12)|
	 ((HAL_GPIO_ReadPin(D13_GPIO_Port, D13_Pin)&0x1)<<13)|
	 ((HAL_GPIO_ReadPin(D14_GPIO_Port, D14_Pin)&0x1)<<14)|
	 ((HAL_GPIO_ReadPin(D15_GPIO_Port, D15_Pin)&0x1)<<15);


    /* Read twice to ensure correct data */

    /* read data OK */

/*
    PE.00(D0), PE.01(D1), PE.02(D2), PE.03(D3), PE.04(D4), PE.05(D5), PE.06(D6), PE.07(D7), PE.08(D8)
    PE.09(D9), PE.10(D10), PE.11(D11), PE.12(D12), PE.13(D13), PE.14(D14), PE.15(D15)
*/

    /* setting the IO to output mode */

//    GPIO_InitStructure.GPIO_Pin = GPIO_Pin_All;
//    GPIO_InitStructure.GPIO_Speed = GPIO_Speed_50MHz;
//    GPIO_InitStructure.GPIO_Mode = GPIO_Mode_Out_PP;
//    GPIO_Init(GPIOE, &GPIO_InitStructure);

    HAL_GPIO_WritePin(GPIOC, D03_Pin|D04_Pin|RD_Pin|WR_Pin
                            |RS_Pin, GPIO_PIN_RESET);

    HAL_GPIO_WritePin(GPIOA, CS_Pin|D11_Pin, GPIO_PIN_RESET);

    HAL_GPIO_WritePin(GPIOB, D00_Pin|D01_Pin|D02_Pin|D10_Pin
                            |D12_Pin|D13_Pin|D14_Pin|D15_Pin
                            |D05_Pin|D06_Pin|D07_Pin|D08_Pin
                            |D09_Pin, GPIO_PIN_RESET);

    GPIO_InitStruct.Pin = D03_Pin|D04_Pin|RD_Pin|WR_Pin
                            |RS_Pin;
    GPIO_InitStruct.Mode = GPIO_MODE_OUTPUT_PP;
    GPIO_InitStruct.Pull = GPIO_NOPULL;
    GPIO_InitStruct.Speed = GPIO_SPEED_FREQ_VERY_HIGH;
    HAL_GPIO_Init(GPIOC, &GPIO_InitStruct);

    GPIO_InitStruct.Pin = D00_Pin|D01_Pin|D02_Pin|D10_Pin
                            |D12_Pin|D13_Pin|D14_Pin|D15_Pin
                            |D05_Pin|D06_Pin|D07_Pin|D08_Pin
                            |D09_Pin;
    GPIO_InitStruct.Mode = GPIO_MODE_OUTPUT_PP;
    GPIO_InitStruct.Pull = GPIO_NOPULL;
    GPIO_InitStruct.Speed = GPIO_SPEED_FREQ_VERY_HIGH;
    HAL_GPIO_Init(GPIOB, &GPIO_InitStruct);

    GPIO_InitStruct.Pin = CS_Pin|D11_Pin;
    GPIO_InitStruct.Mode = GPIO_MODE_OUTPUT_PP;
    GPIO_InitStruct.Pull = GPIO_NOPULL;
    GPIO_InitStruct.Speed = GPIO_SPEED_FREQ_VERY_HIGH;
    HAL_GPIO_Init(GPIOA, &GPIO_InitStruct);


    Set_nRd;   /* Rd high */

    return value;  /* return data */
}


/*******************************************************************************
* Function Name  : LCD_WriteReg
* Description    : Writes to the selected LCD register.
* Input          : - LCD_Reg: address of the selected register.
*                  - LCD_RegValue: value to write to the selected register.
* Output         : None
* Return         : None
* Attention	 : None
*******************************************************************************/
void LCD_WriteReg( unsigned short LCD_Reg, unsigned short LCD_RegValue )
{ 
	/* Write 16-bit Index, then Write Reg */

	Clr_Cs;   /* Cs low */ 

        /* selected LCD register */ 
	LCD_WriteIndex(LCD_Reg);
      
	/* Write register data */
	LCD_WriteData(LCD_RegValue);
  
	Set_Cs;   /* Cs high */
}

