VikSle/STM32F411RE_FreeRtos/Library/HY32D/GLCD/GLCD.c
/*******************************************************************************
* Function Name  : LCD_ReadReg
* Description    : Reads the selected LCD register data.
* Input          : - LCD_Reg: address of the selected register.
* Output         : None
* Return         : return Register data.
* Attention	 : None
*******************************************************************************/
unsigned short LCD_ReadReg(unsigned short LCD_Reg)
{
	unsigned short LCD_RAM;
	
	Clr_Cs;  /* Cs low */ 
 
        /* selected LCD register */ 
	LCD_WriteIndex(LCD_Reg);

	/* Write register data */
	LCD_RAM = LCD_ReadData(); 
     	
	Set_Cs;  /* Cs high */

        /* return read data */
	return LCD_RAM;
}

/*******************************************************************************
* Function Name  : LCD_SetCursor
* Description    : Sets the cursor position.
* Input          : - Xpos: specifies the X position.
*                  - Ypos: specifies the Y position. 
* Output         : None
* Return         : None
* Attention		 : None
*******************************************************************************/
void LCD_SetCursor( unsigned short Xpos, unsigned short Ypos )
{
    LCD_WriteReg(0x0020, Xpos );     
    LCD_WriteReg(0x0021, Ypos );     
}


/*******************************************************************************
* Function Name  : LCD_Delay
* Description    : Delay Time
* Input          : - nCount: Delay Time
* Output         : None
* Return         : None
* Return         : None
* Attention	 : None
*******************************************************************************/
void delay_ms( unsigned short ms )    
{ 
	unsigned short i, j;

	for( i = 0; i < ms; i++ )
	{ 
		for( j = 0; j < 1141; j++ );
	}
} 

/*******************************************************************************
* Function Name  : LCD_Initializtion
* Description    : Initialize TFT Controller.
* Input          : None
* Output         : None
* Return         : None
* Attention	 : None
*******************************************************************************/
void LCD_Initializtion(void)
{
	unsigned short LCD_ID;
	
	LCD_Configuration();

	LCD_ID = LCD_ReadReg(0x0000);		/* read the LCD ID, if Controller is ILI9320, The ID value is 0x9320 */
	
	
	//if( DeviceCode == 0x9320 || DeviceCode == 0x9300 )
	if( LCD_ID == 0x9320 || LCD_ID == 0x9300 )
	{
	    LCD_WriteReg(0x00,0x0000);
	    LCD_WriteReg(0x01,0x0100);	/* Driver Output Contral */
	    LCD_WriteReg(0x02,0x0700);	/* LCD Driver Waveform Contral */
	    LCD_WriteReg(0x03,0x1018);	/* Entry Mode Set */
		
	    LCD_WriteReg(0x04,0x0000);	/* Scalling Contral */
	    LCD_WriteReg(0x08,0x0202);	/* Display Contral */
	    LCD_WriteReg(0x09,0x0000);	/* Display Contral 3.(0x0000) */
	    LCD_WriteReg(0x0a,0x0000);	/* Frame Cycle Contal.(0x0000) */
	    LCD_WriteReg(0x0c,(1<<0));	/* Extern Display Interface Contral */
	    LCD_WriteReg(0x0d,0x0000);	/* Frame Maker Position */
	    LCD_WriteReg(0x0f,0x0000);	/* Extern Display Interface Contral 2. */
		
	    HAL_Delay(100);//delay_ms(100);  /* delay 100 ms */
	    LCD_WriteReg(0x07,0x0101);	/* Display Contral */
	    HAL_Delay(100);//delay_ms(100);  /* delay 100 ms */
	
	    LCD_WriteReg(0x10,(1<<12)|(0<<8)|(1<<7)|(1<<6)|(0<<4));	/* Power Control 1.(0x16b0)	*/
	    LCD_WriteReg(0x11,0x0007);								/* Power Control 2 */
	    LCD_WriteReg(0x12,(1<<8)|(1<<4)|(0<<0));				/* Power Control 3.(0x0138)	*/
	    LCD_WriteReg(0x13,0x0b00);								/* Power Control 4 */
	    LCD_WriteReg(0x29,0x0000);								/* Power Control 7 */
		
	    LCD_WriteReg(0x2b,(1<<14)|(1<<4));
			
	    LCD_WriteReg(0x50,0);       /* Set X Start */
	    LCD_WriteReg(0x51,239);	    /* Set X End */
	    LCD_WriteReg(0x52,0);	    /* Set Y Start */
	    LCD_WriteReg(0x53,319);	    /* Set Y End */
		
	    LCD_WriteReg(0x60,0x2700);	/* Driver Output Control */
	    LCD_WriteReg(0x61,0x0001);	/* Driver Output Control */
	    LCD_WriteReg(0x6a,0x0000);	/* Vertical Srcoll Control */
		
	    LCD_WriteReg(0x80,0x0000);	/* Display Position? Partial Display 1 */
	    LCD_WriteReg(0x81,0x0000);	/* RAM Address Start? Partial Display 1 */
	    LCD_WriteReg(0x82,0x0000);	/* RAM Address End-Partial Display 1 */
	    LCD_WriteReg(0x83,0x0000);	/* Displsy Position? Partial Display 2 */
	    LCD_WriteReg(0x84,0x0000);	/* RAM Address Start? Partial Display 2 */
	    LCD_WriteReg(0x85,0x0000);	/* RAM Address End? Partial Display 2 */
		
	    LCD_WriteReg(0x90,(0<<7)|(16<<0));	/* Frame Cycle Contral.(0x0013)	*/
	    LCD_WriteReg(0x92,0x0000);	/* Panel Interface Contral 2.(0x0000) */
	    LCD_WriteReg(0x93,0x0001);	/* Panel Interface Contral 3. */
	    LCD_WriteReg(0x95,0x0110);	/* Frame Cycle Contral.(0x0110)	*/
	    LCD_WriteReg(0x97,(0<<8));	
	    LCD_WriteReg(0x98,0x0000);	/* Frame Cycle Contral */
	    LCD_WriteReg(0x07,0x0173);
	}
        else
        {
              /* read LCD ID fail, testing terminated */
              /* fatal error */
              while(1);
        }					
	HAL_Delay(50);//delay_ms(50);   /* delay 50 ms */
}

/*******************************************************************************
* Function Name  : LCD_Clear
* Description    : clear LCD screen
* Input          : - Color: LCD screen color
* Output         : None
* Return         : None
* Attention	 : None
*******************************************************************************/
void LCD_Clear( unsigned short color )
{
	unsigned int index=0;
	
	LCD_SetCursor(0,0); 
	
	Clr_Cs;  /* Cs low */

        /* selected LCD register */ 
	LCD_WriteIndex(0x0022);

	for( index = 0; index < MAX_X * MAX_Y; index++ )
	{
                /* Write data */
		LCD_WriteData( color );
	}

	Set_Cs;  /* Cs high */
}

/******************************************************************************
* Function Name  : LCD_BGR2RGB
* Description    : RRRRRGGGGGGBBBBB change BBBBBGGGGGGRRRRR
* Input          : - color: BRG color value
* Output         : None
* Return         : RGB color value
* Attention	 : None
*******************************************************************************/
unsigned short LCD_BGR2RGB( unsigned short color )
{
	unsigned short  r, g, b, rgb;
	
